<template>
  <div>
    <div class="bs-callout bs-callout-info">
      <h4>Что учить для старта</h4>
      <ul>
        <li><a href="https://evgeniypopov.com/">Quick Basic</a> Для тех кому хочеться понимать "Олдов". Самый популярный язык в 80-е годы на нём писали консольные программы и игры для первых доступных простым людям компьютерах которые могли выдавать простую 2d графику но достаточно чёткую чтобы можно было нарисовать какой нибудь нормально воспринимаемый игровой мир</li>
        <li><a href="https://evgeniypopov.com/">C++</a> Для тех кому нравиться направление Универсальное программирование - на C++ создают десктопные приложения и разрабатываю хардкорные алгоритмы требующие максимума производительности, это первый популярный ООП язык живущий и развивающийся немного и по сегодняшний день</li>
        <li><a href="https://evgeniypopov.com/">JS</a> Самый популярный язык вообще, используеться для вэб-разработки и необходим для професии верстальщик которая щитаеться простой професией (то что она простая неправда - просто в ней слишком много начинающих школьников которые делают за копейки работу, но порог вхождения точно проще) с которой начинают большинство вэб-разработчиков</li>
      </ul>
    </div>
    <div class="bs-callout bs-callout-info">
      <h4>Сайты с обучающими курсами как онлайн так и оффлайн</h4>
      <ul>
        <li><a href="https://evgeniypopov.com/">Евгений Попов</a> Первый успешный автор видеокурсов по инфобизнесу в интернете на территории СНГ.</li>
        <li><a href="https://1popov.ru/#shops">Курсы от Евгения Попова</a></li>
        <li><a href="https://ntschool.ru/">Школа современных технологий</a> Платное онлайн обучение программированию и не только (можно поискать камрипы на торентах если вы неплатеже способный... И теряете всякие плюшки в виде сертификата и доступа к форуму)</li>
        <li><a href="https://webformyself.com/nashi-kursy/">Webformyself</a> Мощный проект по сайтостроению (гора качественных видеокурсов по всем направлениям из данной темы)</li>
        <li><a href="https://loftblog.ru/">Loftblog</a> Мощный портал бесплатных видеоуроков по всем IT темам</li>
        <li><a href="https://www.youtube.com/user/BachiloDmitry">Дмитрий Бачило</a> История компьютерных технологий, игр и другое.</li>
        <li><a href="https://www.duolingo.com/">Duolingo</a> Обучение английскому и другим языкам - единственный нормальный бесплатный сервис который я нашёл, есть мобильное приложение</li>
      </ul>
      <h4>Более специализированные</h4>
      <ul>
        <li><a href="https://learn.javascript.ru/">javascript.ru</a> Хорошие скринкасты (Node.js, Webpack, Gulp 4, React.js, Angular, Git) по технологиям связынным с js, также есть платные курсы</li>
        <li><a href="https://www.sololearn.com/">Sololearn</a> Бесплатные автоматические курсы обучения по всем направлениям, есть мобильное приложение и в нём есть версии на Русском языке, уровень обучения базовый (некоторые курсы очень поверхностные но затрагивают сложные темы поэтому я дал название им ознакомительные они подходят для тех кто уже знает программирование и хочет посмотреть как выглядят другие технологии...)!</li>
      </ul>
    </div>
  </div>
</template>

<script>
  import {contentTypes} from "../../components/content-types/contentTypes";
  import _ from 'lodash'

  import {mContentHashes} from '../../components/scroll-hash/mContentHashes'

  export default {
    layout: 'default',

    metaInfo () {
      //todo-orel перевод
      const { appName } = window.config

      return {
        title: 'Обучение основам',
        titleTemplate: `${appName} - %s`
      }
    },

    mixins: [mContentHashes],

    components: {

    },

    data() {
      return {

      }
    },

    methods: {

    },

    created() {

    },

    mounted: function () {

    }
  }
</script>